function [W1,W2,W3,W4,W5,W6]=givens(w)
    c1=cos(w(1));s1=sin(w(1));
    c2=cos(w(2));s2=sin(w(2));
    c3=cos(w(3));s3=sin(w(3));
    c4=cos(w(4));s4=sin(w(4));
    c5=cos(w(5));s5=sin(w(5));
    c6=cos(w(6));s6=sin(w(6));
    W1=[1,0,0,0;0,1,0,0;0,0,c1,-s1;0,0,s1,c1];
    W2=[1,0,0,0;0,c2,0,-s2;0,0,1,0;0,s2,0,c2];%，在 MATLAB 中可以直接调用 givens() 函数来进行计算
    W3=[1,0,0,0;0,c3,-s3,0;0,s3,c3,0;0,0,0,1];
    W4=[c4,0,0,-s4;0,1,0,0;0,0,1,0;s4,0,0,c4];
    W5=[c5,0,-s5,0;0,1,0,0;s5,0,c5,0;0,0,0,1];%，在 MATLAB 中可以直接调用 givens() 函数来进行计算
    W6=[c6,-s6,0,0;s6,c6,0,0;0,0,1,0;0,0,0,1];
